#include "HC89F0650.h"
#include "Uart.h"
#include "RTC.h"


/***************************************************************************************
 * @说明  	RTC中断服务函数
 *	@参数	无
 * @返回值 无
 * @注		无
 ***************************************************************************************/
void Rtc_Irt()interrupt RTC_VECTOR
{			
    P0_1 =! P0_1; 					   //P01翻转
    RTCC &= ~0x80;					   //清除中断标志位
}

/***************************************************************************************
 * @说明  	RTC初始化
 *	@参数	无
 * @返回值 无
 * @注		使能RTC中断以及RTC输出，中断时间1s
 ***************************************************************************************/
void RCT_Init(void)
{
    CLKCON |= 0x04;						//使能外部晶振
    while((CLKCON&0x40)!=0x40);			//等待外部低频晶振起振
    RTCC = 0x13;				   		//RTC中断时间1s,允许RTC时钟输出
    RTCO_MAP = 0x00;					//RCT时钟输出映射P0.0口
}

